
## Plan Result

[CI link](https://github.com/ruzickap/my-git-projects/actions/runs/14943183917)


<pre><code>Plan: 0 to add, 4 to change, 0 to destroy.</code></pre>

* Update
  * cloudflare_zero_trust_access_application.msr_2
  * cloudflare_zero_trust_access_identity_provider.google_oauth
  * cloudflare_zero_trust_access_policy.google_sso_access
  * cloudflare_zero_trust_access_policy.uptimerobot_direct_access


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_zero_trust_access_application.msr_2 will be updated in-place
  ~ resource "cloudflare_zero_trust_access_application" "msr_2" {
      - allowed_idps                 = [] -> null
      ~ aud                          = "0c604237dc727565526218aecc4e5b725c5b434b0d77ea929f5c436983300438" -> (known after apply)
      ~ created_at                   = "2025-05-10T06:44:02Z" -> (known after apply)
      - destinations                 = [
          - {
              - type = "public" -> null
              - uri  = "msr-2-2.mylabs.dev" -> null
            },
        ] -> null
        id                           = "27f161c0-271d-4df1-a001-c4bb1c5fb1ea"
      + landing_page_design          = (known after apply)
        name                         = "msr-2-2"
      - options_preflight_bypass     = false -> null
      + path_cookie_attribute        = false
      ~ policies                     = [
          ~ {
              - decision   = "bypass" -> null
              - exclude    = [] -> null
                id         = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
              - include    = [
                  - {
                      - ip_list = {
                          - id = "45069e77-095c-462c-86d7-98fa9731a0da" -> null
                        } -> null
                    },
                ] -> null
              - name       = "UptimeRobot Direct Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
          ~ {
              - decision   = "allow" -> null
              - exclude    = [] -> null
                id         = "2c8404fb-81ca-4bab-835f-b933c0649e90"
              - include    = [
                  - {
                      - email = {
                          - email = "petr.ruzicka@gmail.com" -> null
                        } -> null
                    },
                ] -> null
              - name       = "Google SSO Access - 2" -> null
              - require    = [] -> null
                # (1 unchanged attribute hidden)
            },
        ]
      + saas_app                     = (known after apply)
      - self_hosted_domains          = [
          - "msr-2-2.mylabs.dev",
        ] -> null
      + skip_app_launcher_login_page = false
      ~ tags                         = [
          - "wifi",
            "iot",
          + "wifi",
        ]
      ~ updated_at                   = "2025-05-10T07:25:59Z" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_identity_provider.google_oauth will be updated in-place
  ~ resource "cloudflare_zero_trust_access_identity_provider" "google_oauth" {
      ~ config      = {
          + client_secret = (sensitive value)
          ~ redirect_url  = "https://xvxcz.cloudflareaccess.com/cdn-cgi/access/callback" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        id          = "1a36ca86-d5c6-4e00-b003-006e2034fff3"
        name        = "My Test Google IDP - 2"
      ~ scim_config = {
          ~ enabled                  = false -> (known after apply)
          + identity_update_behavior = (known after apply)
          + scim_base_url            = (known after apply)
          ~ seat_deprovision         = false -> (known after apply)
          + secret                   = (sensitive value)
          ~ user_deprovision         = false -> (known after apply)
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.google_sso_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "google_sso_access" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-05-10T06:44:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "2c8404fb-81ca-4bab-835f-b933c0649e90"
        name             = "Google SSO Access - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-10T07:25:58Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # cloudflare_zero_trust_access_policy.uptimerobot_direct_access will be updated in-place
  ~ resource "cloudflare_zero_trust_access_policy" "uptimerobot_direct_access" {
      ~ app_count        = 1 -> (known after apply)
      ~ created_at       = "2025-05-10T06:44:01Z" -> (known after apply)
      - exclude          = [] -> null
        id               = "afb24198-2c3b-4dd7-a4b7-3fb0bc03ad77"
        name             = "UptimeRobot Direct Access - 2"
      - require          = [] -> null
      ~ reusable         = true -> (known after apply)
      ~ updated_at       = "2025-05-10T07:25:54Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tofu-cloudflare","PRNumber":190,"Program":"tfcmt","SHA1":"17619c75f61d5ad32899a54e095fc5d9bc87f49c","Vars":{},"WorkflowName":"tofu-cloudflare"} -->